FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПакетыДопоборудованияКСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПакетыДопоборудованияКСО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АртикулДляПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьСписокВыбораДляЗамен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Детали для выполнения работ по заказ-наряду</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вариация</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Деталь для выполнения работ по заказ-наряду</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество деталей</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена детали</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
					<Comment>Работы по заказ-наряду</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вариация</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Comment>Работа для выполнения заказ-наряда</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество работ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нормочас</Name>
							<Comment>Нормочас работы</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Цена нормочаса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена в валюте документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество*Коэффициент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вариации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вариация</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариацииМодели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вариация</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПакетыДопоборудованияКСО/Ext/ManagerModule.bsl
//получить Список товаров и работ
Функция ПолучитьТаблицыПоМодели(СсылкаНаШаблон, МодельАвтомобиля) Экспорт
	
	// Получим данные о вариациях пакетным запросом
	ДанныеОВариациях = ПолучитьДанныеОВариациях(СсылкаНаШаблон, МодельАвтомобиля);
	
	//Данные о вариациях
	ИдентификаторВариацииПоУмолчанию = ДанныеОВариациях.ИдентификаторВариацииПоУмолчанию;
	МоделиВариацииПоУмолчанию = ДанныеОВариациях.МоделиВариацииПоУмолчанию;
	ДобавленныеВариацииПоМоделиАвтомобиля = ДанныеОВариациях.ДобавленныеВариацииПоМоделиАвтомобиля;
	
	ИспользуемаяВариация = Неопределено;
	
	// Определим какую вариацию будем использовать
	Если ДобавленныеВариацииПоМоделиАвтомобиля.Количество() = 0 Тогда
		//Если Вариаций не найдено то будем использовать вариацию по умолчанию
		Если НЕ МоделиВариацииПоУмолчанию.Количество() Тогда
			//Если у вариации по умолчанию нет ограничений то используем ее
			ИспользуемаяВариация = ИдентификаторВариацииПоУмолчанию;
		Иначе 
			//Если есть ограничения то проверим что модель есть в списке
			ИспользуемаяВариация = МоделиВариацииПоУмолчанию.Найти(МодельАвтомобиля);
			//Если не найдено то установится НЕОПРЕДЕЛЕННО
		КонецЕсли;
	ИначеЕсли МоделиВариацииПоУмолчанию.Количество() > 2 Тогда
		// Не должно быть две и более вариаций по одной модели автомобиля
		Сообщить("Ошибка! Не должно быть по одной модели несколько вариаций");
		Возврат Неопределено;
	Иначе
		ИспользуемаяВариация = ДобавленныеВариацииПоМоделиАвтомобиля[0].Вариация;
	КонецЕсли;
	
	// Проверим что мы определили вариаци.
	Если НЕ ЗначениеЗаполнено(ИспользуемаяВариация) Тогда
		Сообщить("По модели <"+МодельАвтомобиля+"> не определена вариация в шаблоне <" + СсылкаНаШаблон.Наименование + ">!");
		Возврат Неопределено;
	КонецЕсли;
	
	// Получим таблицы вариации
	СтруктураТаблицВариации = ПолучитьТаблицыВариаций(СсылкаНаШаблон, ИспользуемаяВариация);
	Возврат СтруктураТаблицВариации;
	
КонецФункции

Функция ПолучитьДанныеОВариациях(СсылкаНаШаблон, МодельАвтомобиля) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПакетыДопоборудованияКСОВариации.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ИдентификаторВариацииПоУмолчанию
		|ИЗ
		|	Справочник.ПакетыДопоборудованияКСО.Вариации КАК ПакетыДопоборудованияКСОВариации
		|ГДЕ
		|	ПакетыДопоборудованияКСОВариации.Наименование = &Наименование
		|	И ПакетыДопоборудованияКСОВариации.Ссылка = &СсылкаНаШаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПакетыДопоборудованияКСОВариацииМодели.Модель КАК Модель
		|ПОМЕСТИТЬ МоделиВариацииПоУмолчанию
		|ИЗ
		|	Справочник.ПакетыДопоборудованияКСО.ВариацииМодели КАК ПакетыДопоборудованияКСОВариацииМодели
		|ГДЕ
		|	ПакетыДопоборудованияКСОВариацииМодели.Ссылка = &СсылкаНаШаблон
		|	И ПакетыДопоборудованияКСОВариацииМодели.Вариация В
		|			(ВЫБРАТЬ
		|				ИдентификаторВариацииПоУмолчанию.Идентификатор КАК Идентификатор
		|			ИЗ
		|				ИдентификаторВариацииПоУмолчанию КАК ИдентификаторВариацииПоУмолчанию)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПакетыДопоборудованияКСОВариацииМодели.Вариация КАК Вариация
		|ПОМЕСТИТЬ ДобавленныеВариацииПоМоделиАвтомобиля
		|ИЗ
		|	Справочник.ПакетыДопоборудованияКСО.ВариацииМодели КАК ПакетыДопоборудованияКСОВариацииМодели
		|ГДЕ
		|	ПакетыДопоборудованияКСОВариацииМодели.Ссылка = &СсылкаНаШаблон
		|	И ПакетыДопоборудованияКСОВариацииМодели.Модель = &МодельАвтомобиля
		|	И НЕ ПакетыДопоборудованияКСОВариацииМодели.Вариация В
		|				(ВЫБРАТЬ
		|					ИдентификаторВариацииПоУмолчанию.Идентификатор КАК Идентификатор
		|				ИЗ
		|					ИдентификаторВариацииПоУмолчанию КАК ИдентификаторВариацииПоУмолчанию)";
	
	Запрос.УстановитьПараметр("Наименование", "<По умолчанию>");
	Запрос.УстановитьПараметр("СсылкаНаШаблон", СсылкаНаШаблон);
	Запрос.УстановитьПараметр("МодельАвтомобиля", МодельАвтомобиля);
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	ИдентификаторВариацииПоУмолчанию 		= Запрос.МенеджерВременныхТаблиц.Таблицы[0].ПолучитьДанные().Выгрузить();
	МоделиВариацииПоУмолчанию 				= Запрос.МенеджерВременныхТаблиц.Таблицы[1].ПолучитьДанные().Выгрузить();
	ДобавленныеВариацииПоМоделиАвтомобиля 	= Запрос.МенеджерВременныхТаблиц.Таблицы[2].ПолучитьДанные().Выгрузить();
	
	//Идентификатор вариации по умолчанию всегда должен быть один
	Если ИдентификаторВариацииПоУмолчанию.Количество() = 1 Тогда
		ИдентификаторВариацииПоУмолчанию = ИдентификаторВариацииПоУмолчанию[0].Идентификатор;
	Иначе
		ИдентификаторВариацииПоУмолчанию = Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ИдентификаторВариацииПоУмолчанию", ИдентификаторВариацииПоУмолчанию);
	СтруктураВозврата.Вставить("МоделиВариацииПоУмолчанию", МоделиВариацииПоУмолчанию);
	СтруктураВозврата.Вставить("ДобавленныеВариацииПоМоделиАвтомобиля", ДобавленныеВариацииПоМоделиАвтомобиля);
	
	Возврат СтруктураВозврата;
	
КонецФункции
Функция ПолучитьТаблицыВариаций(СсылкаНаШаблон, ИдентификаторВариации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПакетыДопоборудованияКСОТовары.Номенклатура КАК Номенклатура,
		|	ПакетыДопоборудованияКСОТовары.Количество КАК Количество,
		|	ПакетыДопоборудованияКСОТовары.Коэффициент КАК Коэффициент,
		|	ПакетыДопоборудованияКСОТовары.Цена КАК Цена,
		|	ПакетыДопоборудованияКСОТовары.Сумма КАК Сумма
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Справочник.ПакетыДопоборудованияКСО.Товары КАК ПакетыДопоборудованияКСОТовары
		|ГДЕ
		|	ПакетыДопоборудованияКСОТовары.Вариация = &ИдентификаторВариации
		|	И ПакетыДопоборудованияКСОТовары.Ссылка = &СсылкаНаШаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПакетыДопоборудованияКСОРаботы.Работа КАК Работа,
		|	ПакетыДопоборудованияКСОРаботы.Количество КАК Количество,
		|	ПакетыДопоборудованияКСОРаботы.Нормочас КАК Нормочас,
		|	ПакетыДопоборудованияКСОРаботы.Коэффициент КАК Коэффициент,
		|	ПакетыДопоборудованияКСОРаботы.Цена КАК Цена,
		|	ПакетыДопоборудованияКСОРаботы.Сумма КАК Сумма
		|ПОМЕСТИТЬ Работы
		|ИЗ
		|	Справочник.ПакетыДопоборудованияКСО.Работы КАК ПакетыДопоборудованияКСОРаботы
		|ГДЕ
		|	ПакетыДопоборудованияКСОРаботы.Вариация = &ИдентификаторВариации
		|	И ПакетыДопоборудованияКСОРаботы.Ссылка = &СсылкаНаШаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПакетыДопоборудованияКСОЗамены.Номенклатура КАК Номенклатура,
		|	ПакетыДопоборудованияКСОЗамены.ЗаменаНоменклатуры КАК ЗаменаНоменклатуры,
		|	ПакетыДопоборудованияКСОЗамены.НоваяЦена КАК НоваяЦена
		|ПОМЕСТИТЬ Замены
		|ИЗ
		|	Справочник.ПакетыДопоборудованияКСО.Замены КАК ПакетыДопоборудованияКСОЗамены
		|ГДЕ
		|	ПакетыДопоборудованияКСОЗамены.Вариация = &ИдентификаторВариации
		|	И ПакетыДопоборудованияКСОЗамены.Ссылка = &СсылкаНаШаблон";
	
	Запрос.УстановитьПараметр("ИдентификаторВариации", ИдентификаторВариации);
	Запрос.УстановитьПараметр("СсылкаНаШаблон", СсылкаНаШаблон);
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
			
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Товары", Запрос.МенеджерВременныхТаблиц.Таблицы[0].ПолучитьДанные().Выгрузить());
	СтруктураВозврата.Вставить("Работы", Запрос.МенеджерВременныхТаблиц.Таблицы[1].ПолучитьДанные().Выгрузить());
	СтруктураВозврата.Вставить("Замены", Запрос.МенеджерВременныхТаблиц.Таблицы[2].ПолучитьДанные().Выгрузить());
	
	Возврат СтруктураВозврата;
	
КонецФункции
